import streamlit as st

# 1. หัวข้อใหญ่: แนะนำตัวหลักและชื่อเจ้าของเว็บ
st.title("✨ My Digital Profile")

# 2. หัวข้อย่อยที่ 1: แนะนำตัว
st.header("🌼 แนะนำตัว")
st.write("นาย รวิภัทร ฤทธิศร")
st.write("ชื่อเล่น ไรโน่")
st.write("เลขที่ 6 ม.4/6")

# 3. หัวข้อย่อยที่ 2: เป้าหมายและสิ่งที่อยากทำในอนาคต
st.header("🎯 เป้าหมายและสิ่งที่อยากทำในอนาคต")
st.write("เป้าหมาย : **อยากเรียนด้านคอมพิวเตอร์และเทคโนโลยีเกี่ยวกับการออกแบบโครงสร้างของบ้าน")
st.write("สิ่งที่อยากเป็นในอนาคต : วิศาวะกรโยธา (Civil Engineer)")
